app/views/tallers/_form.html.erb

SELECT `comunas`.* FROM `comunas`
---
    <%= f.label :comuna_id %><br>
    <%= f.collection_select :comuna_id, Comuna.all, :id, :com_nombre %>