app/views/tallers/show.html.erb

</p>
<%if  !Postulacion.where(:encargado_id => current_user.id, :post_estado => ["Espera","Activo"]).count == 0%>
---
SELECT COUNT(*) FROM `postulacions` WHERE `postulacions`.`encargado_id` = 2 AND `postulacions`.`post_estado` IN ('Espera', 'Activo')