app/views/vista/index.html.erb

				<h1>Bienvenido <%= current_user.usuar_nom_usuario %> a BicitMe:</h1>
				<%if  Postulacion.where(:encargado_id => current_user.id, :post_estado => "Activo").count == 0%>
---
SELECT COUNT(*) FROM `postulacions` WHERE `postulacions`.`encargado_id` = 2 AND `postulacions`.`post_estado` = 'Activo'