app/controllers/comunas_controller.rb

  def index
    @comunas = Comuna.all
---
SELECT `comunas`.* FROM `comunas`