app/controllers/reparacions_controller.rb

SELECT `reparacions`.* FROM `reparacions`
---
  def index
    @reparacions = Reparacion.all