app/controllers/usuarios_controller.rb

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` IS NULL  ORDER BY `usuarios`.`id` ASC LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params[:id])